/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@ %2$[Mikä tahansa päivä]@";
"%@ %[Today]@" = "%1$@ %2$[Tänään]@";
"%@ %[Since Yesterday]@" = "%1$@ %2$[Eilisen jälkeen]@";
"%@ %[This week]@" = "%1$@ %2$[Tällä viikolla]@";
"%@ %[Within Last 2 weeks]@" = "%1$@ %2$[Viimeksi kuluneen 2 viikon aikana]@";
"%@ %[This month]@" = "%1$@ %2$[Tässä kuussa]@";
"%@ %[Within Last 2 months]@" = "%1$@ %2$[Viimeksi kuluneen 2 kuukauden aikana]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@ %2$[Mikä tahansa]@";
"%@ %[Yes]@" = "%1$@ %2$[Kyllä]@";
"%@ %[No]@" = "%1$@ %2$[Ei]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@ %2$[Sisältää]@ %3$@";
"%@ %[Begins With]@ %@" = "%1$@ %2$[Alkaa]@ %3$@";
"%@ %[Ends With]@ %@" = "%1$@ %2$[Loppuu]@ %3$@";
"%@ %[Is]@ %@" = "%1$@ %2$[On]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@ %2$[Täsmälleen]@ %3$@";
"%@ %[Before]@ %@" = "%1$@ %2$[Ennen]@ %3$@";
"%@ %[After]@ %@" = "%1$@ %2$[Jälkeen]@ %3$@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@ %2$[Suurempi kuin]@ %3$@";
"%@ %[Less than]@ %@" = "%1$@ %2$[Vähemmän kuin]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@ %2$[Viimeksi kuluneen]@ %3$@ %4$[päivän aikana]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@ %2$[Viimeksi kuluneen]@ %3$@ %4$[viikon aikana]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@ %2$[Viimeksi kuluneen]@ %3$@ %4$[kuukauden aikana]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@ %2$[Viimeksi kuluneen]@ %3$@ %4$[vuoden aikana]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[Väriavaruus]@ %2$[mikä tahansa väriavaruus]@";
"%[Color Space]@ %[RGB]@" = "%1$[Väriavaruus]@ %2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[Väriavaruus]@ %2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[Väriavaruus]@ %2$[harmaasävy]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[Sisältö]@ sisältää %2$@";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Kesto]@ %2$[pidempi kuin]@ %3$@ %4$[min]@ %5$@ %6$[s]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Kesto]@ %2$[lyhyempi kuin]@ %3$@ %4$[min]@ %5$@ %6$[s]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[Avainsanat]@ %2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[Avainsanat]@ sisältää %2$@";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[Laji]@ on %2$[mikä tahansa]@";
"%[Kind]@ is %[Images]@" = "%1$[Laji]@ on %2$[kuvat]@";
"%[Kind]@ is %[Text]@" = "%1$[Laji]@ on %2$[teksti]@";
"%[Kind]@ is %[PDF]@" = "%1$[Laji]@ on %2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[Laji]@ on %2$[elokuvat]@";
"%[Kind]@ is %[Music]@" = "%1$[Laji]@ on %2$[musiikki]@";
"%[Kind]@ is %[Documents]@" = "%1$[Laji]@ on %2$[dokumentit]@";
"%[Kind]@ is %[Presentations]@" = "%1$[Laji]@ on %2$[esitykset]@";
"%[Kind]@ is %[Folders]@" = "%1$[Laji]@ on %2$[kansiot]@";
"%[Kind]@ is %[Applications]@" = "%1$[Laji]@ on %2$[ohjelmat]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[Laji]@ on %2$[Muut...]@ %3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[Merkki]@ on %2$@";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[Avattu viimeksi]@ %2$[koska tahansa]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[Muokattu viimeksi]@ %2$[koska tahansa]@";
"%[Created]@ %[Any Date]@" = "%1$[Luotu]@ %2$[koska tahansa]@";
"%[Last Opened]@ %[Today]@" = "%1$[Avattu viimeksi]@ %2$[tänään]@";
"%[Last Modified]@ %[Today]@" = "%1$[Muokattu viimeksi]@ %2$[tänään]@";
"%[Created]@ %[Today]@" = "%1$[Luotu]@ %2$[tänään]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[Avattu viimeksi]@ %2$[eilisen jälkeen]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[Muokattu viimeksi]@ %2$[eilisen jälkeen]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[Luotu]@ %2$[eilisin jälkeen]@";
"%[Last Opened]@ %[This week]@" = "%1$[Avattu viimeksi]@ %2$[tällä viikolla]@";
"%[Last Modified]@ %[This week]@" = "%1$[Muokattu viimeksi]@ %2$[tällä viikolla]@";
"%[Created]@ %[This week]@" = "%1$[Luotu]@ %2$[tällä viikolla]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[Avattu viimeksi]@ %2$[viimeksi kuluneen 2 viikon aikana]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[Muokattu viimeksi]@ %2$[viimeksi kuluneen 2 viikon aikana]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[Luotu]@ %2$[viimeksi kuluneen 2 viikon aikana]@";
"%[Last Opened]@ %[This month]@" = "%1$[Avattu viimeksi]@ %2$[tässä kuussa]@";
"%[Last Modified]@ %[This month]@" = "%1$[Muokattu viimeksi]@ %2$[tässä kuussa]@";
"%[Created]@ %[This month]@" = "%1$[Luotu]@ %2$[tässä kuussa]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[Avattu viimeksi]@ %2$[viimeksi kuluneen 2 kuukauden aikana]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[Muokattu viimeksi]@ %2$[viimeksi kuluneen 2 kuukauden aikana]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[Luotu]@ %2$[viimeksi kuluneen 2 kuukauden aikana]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[Avattu viimeksi]@ %2$[täsmälleen]@ %3$@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[Muokattu viimeksi]@ %2$[täsmälleen]@ %3$@";
"%[Created]@ %[Exactly]@ %@" = "%1$[Luotu]@ %2$[täsmälleen]@ %3$@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[Avattu viimeksi]@ %2$[ennen]@ %3$@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[Muokattu viimeksi]@ %2$[ennen]@ %3$@";
"%[Created]@ %[Before]@ %@" = "%1$[Luotu]@ %2$[ennen]@ %3$@";
"%[Last Opened]@ %[After]@ %@" = "%1$[Avattu viimeksi]@ %2$[jälkeen]@ %3$@";
"%[Last Modified]@ %[After]@ %@" = "%1$[Muokattu viimeksi]@ %2$[jälkeen]@ %3$@";
"%[Created]@ %[After]@ %@" = "%1$[Luotu]@ %2$[jälkeen]@ %3$@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[Avattu viimeksi]@ %2$[viimeksi kuluneen]@ %3$@ %4$[päivän aikana]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[Muokattu viimeksi]@ %2$[viimeksi kuluneen]@ %3$@ %4$[päivän aikana]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[Luotu]@ %2$[viimeksi kuluneen]@ %3$@ %4$[päivän aikana]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Avattu viimeksi]@ %2$[viimeksi kuluneen]@ %3$@ %4$[viikon aikana]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Muokattu viimeksi]@ %2$[viimeksi kuluneen]@ %3$@ %4$[viikon aikana]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Luotu]@ %2$[viimeksi kuluneen]@ %3$@ %4$[viikon aikana]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[Avattu viimeksi]@ %2$[viimeksi kuluneen]@ %3$@ %4$[kuukauden aikana]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[Muokattu viimeksi]@ %2$[viimeksi kuluneen]@ %3$@ %4$[kuukauden aikana]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[Luotu]@ %2$[viimeksi kuluneen]@ %3$@ %4$[kuukauden aikana]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[Avattu viimeksi]@ %2$[viimeksi kuluneen]@ %3$@ %4$[vuoden aikana]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[Muokattu viimeksi]@ %2$[viimeksi kuluneen]@ %3$@ %4$[vuoden aikana]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[Luotu]@ %2$[viimeksi kuluneen]@ %3$@ %4$[vuoden aikana]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[Musiikkityyli]@ %2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[Tiedostopääte]@ %2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[Nimi]@ %2$[sisältää]@ %3$@";
"%[Name]@ %[Begins With]@ %@" = "%1$[Nimi]@ %2$[alkaa]@ %3$@";
"%[Name]@ %[Ends With]@ %@" = "%1$[Nimi]@ %2$[loppuu]@ %3$@";
"%[Name]@ %[Is]@ %@" = "%1$[Nimi]@ %2$[on]@ %3$@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[Suuntaus]@ %2$[mikä tahansa suuntaus]@";
"%[Orientation]@ %[Landscape]@" = "%1$[Suuntaus]@ %2$[vaaka]@";
"%[Orientation]@ %[Portrait]@" = "%1$[Suuntaus]@ %2$[pysty]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%[Muu...]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[Käsittelemätön kysely]@ %2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%1$[Etsi]@ %2$@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[Koko]@ %2$[suurempi kuin]@ %3$@ %4$[Kt]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[Koko]@ %2$[pienempi kuin]@ %3$@ %4$[Kt]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[Koko]@ %2$[suurempi kuin]@ %3$@ %4$[Mt]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[Koko]@ %2$[pienempi kuin]@ %3$@ %4$[Mt]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[Koko]@ %2$[suurempi kuin]@ %3$@ %4$[Gt]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[Koko]@ %2$[pienempi kuin]@ %3$@ %4$[Gt]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[Näkyvyys]@ %2$[näkyviä tai näkymättömiä]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[Näkyvyys]@ %2$[näkyviä kohteita]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[Näkyvyys]@ %2$[näkymättömiä kohteita]@";

